@rawmind0 I am seeing this error now:
```
Error: Bad response statusCode [422]. Status [422 Unprocessable Entity]. Body: [baseType=error, code=InvalidFormat, fieldName=amazonElasticContainerServiceConfig, message=subnets=NotNullable 422: ] from [https://rancher.xyz.com/v3/clusters]

  on modules/cattle-eks/bootstrap.tf line 3, in resource "rancher2_cluster" "rancher-custom":
   3: resource "rancher2_cluster" "rancher-custom" {

```

Another observation, when I don't specify `virtual_network` in the config, there is no default value. Even if I specify virtual network's value as `""` or `null`, the plan phase does not show anything at all. Here the difference:
1. Set `virtual_network                 = var.vpc_id == "" ? "" : var.vpc_id` where `var.vpc_id == ""`. Output of `terraform plan`:
```
  + resource "rancher2_cluster" "rancher-custom" {
      + annotations                             = (known after apply)
      + cluster_registration_token              = (known after apply)
      + default_pod_security_policy_template_id = (known after apply)
      + default_project_id                      = (known after apply)
      + description                             = "test-eks Kubernetes cluster"
      + driver                                  = (known after apply)
      + enable_network_policy                   = false
      + id                                      = (known after apply)
      + kube_config                             = (known after apply)
      + labels                                  = (known after apply)
      + name                                    = "test-eks"
      + system_project_id                       = (known after apply)

      + cluster_auth_endpoint {
          + ca_certs = (known after apply)
          + enabled  = (known after apply)
          + fqdn     = (known after apply)
        }

      + eks_config {
          + access_key                      = (sensitive value)
          + ami                             = "ami-0085d4f8878cddc81"
          + associate_worker_node_public_ip = true
          + instance_type                   = "t2.medium"
          + kubernetes_version              = "1.12"
          + maximum_nodes                   = 3
          + minimum_nodes                   = 1
          + node_volume_size                = 20
          + region                          = "eu-central-1"
          + secret_key                      = (sensitive value)
          + security_groups                 = [
              + "",
            ]
          + subnets                         = [
              + "",
            ]
          + user_data                       = (known after apply)
        }
    }
```

2. Manually specify value `var.vpc_id = "test"`. Output:
```
  + resource "rancher2_cluster" "rancher-custom" {
      + annotations                             = (known after apply)
      + cluster_registration_token              = (known after apply)
      + default_pod_security_policy_template_id = (known after apply)
      + default_project_id                      = (known after apply)
      + description                             = "test-eks Kubernetes cluster"
      + driver                                  = (known after apply)
      + enable_network_policy                   = false
      + id                                      = (known after apply)
      + kube_config                             = (known after apply)
      + labels                                  = (known after apply)
      + name                                    = "test-eks"
      + system_project_id                       = (known after apply)

      + cluster_auth_endpoint {
          + ca_certs = (known after apply)
          + enabled  = (known after apply)
          + fqdn     = (known after apply)
        }

      + eks_config {
          + access_key                      = (sensitive value)
          + ami                             = "ami-0085d4f8878cddc81"
          + associate_worker_node_public_ip = true
          + instance_type                   = "t2.medium"
          + kubernetes_version              = "1.12"
          + maximum_nodes                   = 3
          + minimum_nodes                   = 1
          + node_volume_size                = 20
          + region                          = "eu-central-1"
          + secret_key                      = (sensitive value)
          + security_groups                 = [
              + "",
            ]
          + subnets                         = [
              + "",
            ]
          + user_data                       = (known after apply)
          + virtual_network                 = "test"
        }
    }
```

So, if we were to trigger the same API request as the GUI does for allowing Rancher to create VPC and other stuffs, we'd have to allow the user to NOT specify VPC ID and somehow let Rancher know that it should create it when kept empty. I am not sure if I am interpreting this correctly but, this isn't working. Let me know if I should try something else.

Also, I thought there could be a flag to specify whether VPC should be specified by the user or Rancher should create on the behalf of the user. Same goes for subnets. Keeping them empty does not seem to work.

On a side note, I saw this:
https://github.com/terraform-providers/terraform-provider-rancher2/blob/dc38bc3e7b71610c0401074cd42f353c814af52b/rancher2/schema_cluster_eks_config.go#L71-L75

It is a mandatory field which is fine but keeping it empty won't work either in this case. Same goes for subnet.